var words =`*ｱﾙﾒﾆｱ文字(東方言)
Ա / ա	ɑ
Բ / բ	b
Գ / գ	g
Դ / դ	d
Ե / ե	jɛ/ɛ
Զ / զ	z
Է / է	ɛ
Ը / ը	ə
Թ / թ	tʰ
Ժ / ժ	ʒ
Ի / ի	i
Լ / լ	l
Խ / խ	χ
Ծ / ծ	t͡s
Կ / կ	k
Հ / հ	h
Ձ / ձ	d͡z
Ղ / ղ	ʁ
Ճ / ճ	t͡ʃ
Մ / մ	m
Յ / յ	j
Ն / ն	n
Շ / շ	ʃ
Ո / ո	vɔ/ɔ
Չ / չ	t͡ʃʰ
Պ / պ	p
Ջ / ջ	d͡ʒ
Ռ / ռ	r
Ս / ս	s
Վ / վ	v
Տ / տ	t
Ր / ր	ɾ/ɹ
Ց / ց	t͡sʰ
Ւ / ւ	v
Ու / ու	u
Փ / փ	pʰ
Ք / ք	kʰ
- / և	ɛv
Օ / օ	ɔ
Ֆ / ֆ	f
*タイ文字
ก	k  中
ข	kh  高
ฃ	kh  高
ค	kh  低
ฅ	kh  低
ฆ	kh  低
ง	ng  低
จ	c  中
ฉ	ch  高
ช	ch  低
ซ	s  低
ฌ	ch  低
ญ	y  低
ฎ	d  中
ฏ	t  中
ฐ	th  高
ฑ	th  低
ฒ	th  低
ณ	n  低
ด	d  中
ต	t  中
ถ	th  高
ท	th  低
ธ	th  低
น	n  低
บ	b  中
ป	p  中
ผ	ph  高
ฝ	f  高
พ	ph  低
ฟ	f  低
ภ	ph  低
ม	m  低
ย	y  低
ร	r  低
ล	l  低
ว	w  低
ศ	s  高
ษ	s  高
ส	s  高
ห	h  高
ฬ	l  低
อ	ʔ  中
ฮ	h  低
*ゲエズ文字初級
ሀ	h
ለ	l
ሐ	ḥ
መ	m
ሠ	ś
ረ	r
ሰ	s
ቀ	q
በ	b
ተ	t
ኀ	ḫ
ነ	n
አ	ʾ
ከ	k
ወ	w
ዐ	ʿ
ዘ	z
የ	y
ደ	d
ገ	g
ጠ	ṭ
ጰ	pʷ
ጸ	ṣ
ፀ	ḍ
ፈ	f
ፐ	p
ሸ	š
ቸ	č
ኘ	ñ
ኸ	x
ዠ	ž
ጀ	ğ
ጨ	čʷ
*ゲエズ文字上級
ሀ	hä
ሁ	hu
ሂ	hi
ሃ	ha
ሄ	he
ህ	hə
ሆ	ho
ለ	lä
ሉ	lu
ሊ	li
ላ	la
ሌ	le
ል	lə
ሎ	lo
ሐ	ḥä
ሑ	ḥu
ሒ	ḥi
ሓ	ḥa
ሔ	ḥe
ሕ	ḥə
ሖ	ḥo
መ	mä
ሙ	mu
ሚ	mi
ማ	ma
ሜ	me
ም	mə
ሞ	mo
ሠ	śä
ሡ	śu
ሢ	śi
ሣ	śa
ሤ	śe
ሥ	śə
ሦ	śo
ረ	rä
ሩ	ru
ሪ	ri
ራ	ra
ሬ	re
ር	rə
ሮ	ro
ሰ	sä
ሱ	su
ሲ	si
ሳ	sa
ሴ	se
ስ	sə
ሶ	so
ሸ	šä
ሹ	šu
ሺ	ši
ሻ	ša
ሼ	še
ሽ	šə
ሾ	šo
ቀ	qä
ቁ	qu
ቂ	qi
ቃ	qa
ቄ	qe
ቅ	qə
ቆ	qo
በ	bä
ቡ	bu
ቢ	bi
ባ	ba
ቤ	be
ብ	bə
ቦ	bo
ተ	tä
ቱ	tu
ቲ	ti
ታ	ta
ቴ	te
ት	tə
ቶ	to
ቸ	čä
ቹ	ču
ቺ	či
ቻ	ča
ቼ	če
ች	čə
ቾ	čo
ኀ	ḫä
ኁ	ḫu
ኂ	ḫi
ኃ	ḫa
ኄ	ḫe
ኅ	ḫə
ኆ	ḫo
ነ	nä
ኑ	nu
ኒ	ni
ና	na
ኔ	ne
ን	nə
ኖ	no
ኘ	ñä
ኙ	ñu
ኚ	ñi
ኛ	ña
ኜ	ñe
ኝ	ñə
ኞ	ño
አ	ʾä
ኡ	ʾu
ኢ	ʾi
ኣ	ʾa
ኤ	ʾe
እ	ʾə
ኦ	ʾo
ከ	kä
ኩ	ku
ኪ	ki
ካ	ka
ኬ	ke
ክ	kə
ኮ	ko
ኸ	xä
ኹ	xu
ኺ	xi
ኻ	xa
ኼ	xe
ኽ	xə
ኾ	xo
ወ	wä
ዉ	wu
ዊ	wi
ዋ	wa
ዌ	we
ው	wə
ዎ	wo
ዐ	ʿä
ዑ	ʿu
ዒ	ʿi
ዓ	ʿa
ዔ	ʿe
ዕ	ʿə
ዖ	ʿo
ዘ	zä
ዙ	zu
ዚ	zi
ዛ	za
ዜ	ze
ዝ	zə
ዞ	zo
ዠ	žä
ዡ	žu
ዢ	ži
ዣ	ža
ዤ	že
ዥ	žə
ዦ	žo
የ	yä
ዩ	yu
ዪ	yi
ያ	ya
ዬ	ye
ይ	yə
ዮ	yo
ደ	dä
ዱ	du
ዲ	di
ዳ	da
ዴ	de
ድ	də
ዶ	do
ጀ	ǧä
ጁ	ǧu
ጂ	ǧi
ጃ	ǧa
ጄ	ǧe
ጅ	ǧə
ጆ	ǧo
ገ	gä
ጉ	gu
ጊ	gi
ጋ	ga
ጌ	ge
ግ	gə
ጎ	go
ጠ	ṭä
ጡ	ṭu
ጢ	ṭi
ጣ	ṭa
ጤ	ṭe
ጥ	ṭə
ጦ	ṭo
ጨ	čʷä
ጩ	čʷu
ጪ	čwi
ጫ	čʷa
ጬ	čʷe
ጭ	čʷə
ጮ	čʷo
ጰ	pʷä
ጱ	pʷu
ጲ	pʷi
ጳ	pʷa
ጴ	pʷe
ጵ	pʷə
ጶ	pʷo
ጸ	ṣä
ጹ	ṣu
ጺ	ṣi
ጻ	ṣa
ጼ	ṣẹ
ጽ	ṣə
ጾ	ṣo
ፀ	ṣ́ä
ፁ	ṣ́u
ፂ	ṣ́i
ፃ	ṣ́a
ፄ	ṣ́e
ፅ	ṣ́ə
ፆ	ṣ́o
ፈ	fä
ፉ	fu
ፊ	fi
ፋ	fa
ፌ	fe
ፍ	fə
ፎ	fo
ፐ	pä
ፑ	pu
ፒ	pi
ፓ	pa
ፔ	pe
ፕ	pə
ፖ	po
ኰ	kʷä
ኲ	kʷi
ኳ	kʷa
ኴ	kʷe
ኵ	kʷə
ጐ	gʷä
ጒ	gʷi
ጓ	gʷa
ጔ	gʷe
ጕ	gʷə
ቈ	qʷä
ቍ	qʷu
ቊ	qʷi
ቋ	qʷa
ቌ	qʷe
ቍ	qʷə
ኈ	ḫʷä
ኊ	ḫʷi
ኋ	ḫʷa
ኌ	ḫʷe
ኍ	ḫʷə
*ヘブライ文字
א	ʔ
ב	b, v
ג	ɡ
ד	d
ה	h
ו	v
ז	z
ח	x
ט	t
י	j
כ ך	k, x
ל	l
מ ם	m
נ ן	n
ס	s
ע	ʔ
פ ף	p, f
צ ץ	ts
ק	k
ר	ʁ
ש	ʃ, s
ת	t
*グルジア文字
ა	ɑ
ბ	b
გ	ɡ
დ	d
ე	ɛ
ვ	v
ზ	z
თ	tʰ
ი	i
კ	kʼ
ლ	l
მ	m
ნ	n
ო	ɔ
პ	pʼ
ჟ	ʒ
რ	r
ს	s
ტ	tʼ
უ	u
ფ	pʰ
ქ	kʰ
ღ	ɣ
ყ	qʼ
შ	ʃ
ჩ	ʧ
ც	ʦ
ძ	ʣ
წ	ʦʼ
ჭ	ʧʼ
ხ	x, χ
ჯ	ʤ
ჰ	h
*国際音声記号
m̥	無声両唇鼻音
m	有声両唇鼻音
ɱ̊	無声唇歯鼻音
ɱ	有声唇歯鼻音
n̼	有声歯唇鼻音
n̪̊	無声歯音鼻音
n̪	有声歯音鼻音
n̥	無声歯茎鼻音
n	有声歯茎鼻音
ɳ̊	無声そり舌鼻音
ɳ	有声そり舌鼻音
ɲ̊	無声硬口蓋鼻音
ɲ	有声硬口蓋鼻音
ŋ̊	無声軟口蓋鼻音
ŋ	有声軟口蓋鼻音
ɴ	有声口蓋垂鼻音
s	無声歯茎摩擦音
z	有声歯茎摩擦音
ʃ	無声後部歯茎摩擦音
ʒ	有声後部歯茎摩擦音
ʂ	無声そり舌摩擦音
ʐ	有声そり舌摩擦音
ɕ	無声硬口蓋摩擦音
ʑ	有声硬口蓋摩擦音
p͡ɸ	無声両唇破擦音
b͡β	有声両唇破擦音
t̪͡θ	無声歯音破擦音
d̪͡ð	有声歯音破擦音
c͡ç	無声硬口蓋破擦音
ɟ͡ʝ	有声硬口蓋破擦音
k͡x	無声軟口蓋破擦音
ɡ͡ɣ	有声軟口蓋破擦音
q͡χ	無声口蓋垂破擦音
ɢ͡ʁ	有声口蓋垂破擦音
ʡ͡ʢ	有声喉頭蓋破擦音
ʔ͡h	声門破擦音
ɸ	無声両唇摩擦音
β	有声両唇摩擦音
f	無声唇歯摩擦音
v	有声唇歯摩擦音
θ	無声歯音摩擦音
ð	有声歯音摩擦音
ç	無声硬口蓋摩擦音
ʝ	有声硬口蓋摩擦音
x	無声軟口蓋摩擦音
ɣ	有声軟口蓋摩擦音
χ	無声口蓋垂摩擦音
ʁ	有声口蓋垂摩擦音
ħ	無声咽頭摩擦音
ʕ	有声咽頭摩擦音
h	無声声門摩擦音
ɦ	有声声門摩擦音
ʋ	有声唇歯接近音
ɹ	有声歯茎接近音
ɻ	有声そり舌接近音
j	有声硬口蓋接近音
ɰ	有声軟口蓋接近音
ʔ̞	声門接近音
ⱱ	有声唇歯はじき音
ɾ	有声歯茎はじき音
ɽ	有声そり舌はじき音
ʙ	有声両唇ふるえ音
r	有声歯茎ふるえ音
ʀ	有声口蓋垂ふるえ音
ʜ	無声咽頭ふるえ音
ʢ	有声咽頭ふるえ音
ɓ	有声両唇入破音
ɗ	有声歯茎入破音
ᶑ	有声そり舌入破音
ʄ	有声硬口蓋入破音
ɠ	有声軟口蓋入破音
ʛ	有声口蓋垂入破音
pʼ	無声両唇放出破裂音
tʼ	無声歯茎放出破裂音
ʈʼ	無声そり舌放出破裂音
cʼ	無声硬口蓋放出破裂音
kʼ	無声軟口蓋放出破裂音
qʼ	無声口蓋垂放出破裂音
i	前舌 狭 非円唇母音
y	前舌 狭 円唇母音
ɨ	中舌 狭 非円唇母音
ʉ	中舌 狭 円唇母音
ɯ	後舌 狭 非円唇母音
u	後舌 狭 円唇母音
ɪ	前舌 広めの狭 非円唇母音
ʏ	前舌 広めの狭 円唇母音
ʊ	後舌 広めの狭 円唇母音
e	前舌 半狭 非円唇母音
ø	前舌 半狭 円唇母音
ɘ	中舌 半狭 非円唇母音
ɵ	中舌 半狭 円唇母音
ɤ	後舌 半狭 非円唇母音
o	後舌 半狭 円唇母音
ə	中舌 中央 非円唇母音
ø̞	前舌 中央 円唇母音
o̞	後舌 中央 円唇母音
ɛ	前舌 半広 非円唇母音
œ	前舌 半広 円唇母音
ɜ	中舌 半広 非円唇母音
ɞ	中舌 半広 円唇母音
ʌ	後舌 半広 非円唇母音
ɔ	後舌 半広 円唇母音
æ	前舌 狭めの広 非円唇母音
ɐ	中舌 狭めの広 非円唇母音
a	前舌 広 非円唇母音
ɶ	前舌 広 円唇母音
ä	中舌 広 非円唇母音
ɑ	後舌 広 非円唇母音
ɒ	後舌 広 円唇母音
ː	長母音
ˑ	半長母音
̆	超短
̃	鼻母音化
̹ / ̜	円唇強化 / 弱化
̞ / ̝	舌高の低下 / 上昇
̥	無声化（部分的無声）
̬	有声化（部分的有声）
ʰ	帯気
ʱ	有声帯気
ʼ	放出音
̚	内破音
ˀ	声門閉鎖を伴う
̟	前寄り（前舌化など）
̠	後寄り
̝	高め（より狭い調音）
̞	低め（より広い調音）
˖	上寄り
˗	下寄り
̪	歯音化
̺	舌尖音
̻	舌端音
̼	歯唇音
˔	摩擦化（接近→摩擦寄り）
˕	弱摩擦化
ᵊ	有声要素を伴う（弱母音的）
ʷ	唇音化
ʲ	硬口蓋化
ˠ	軟口蓋化
ˤ	咽頭化
ᶣ	唇＋硬口蓋化
ᶭ	舌側化された調音
̃	鼻音化
ⁿ	前鼻音化
ˡ	側面放出
ˣ	軟口蓋摩擦的放出
ˢ	音的放出
̯	非音節的（半母音化）
˞	r化
ˠ	「暗いL」などの後舌化
*ｸﾒｰﾙ文字(ﾁｮｰｶｰ体)
ក ្ក	kâ
ខ ្ខ	khâ
គ ្គ	kô
ឃ ្ឃ	khô
ង ្ង	ngô
ច ្ច	châ
ឆ ្ឆ	chhâ
ជ ្ជ	chô
ឈ ្ឈ	chhô
ញ ្ញ	nhô
ដ ្ដ	dâ
ឋ ្ឋ	thâ
ឌ ្ឌ	dô
ឍ ្ឍ	thô
ណ ្ណ	nâ
ត ្ត	tâ
ថ ្ថ	thâ
ទ ្ទ	tô
ធ ្ធ	thô
ន ្ន	nô
ប ្ប	bâ
ផ ្ផ	phâ
ព ្ព	pô
ភ ្ភ	phô
ម ្ម	mô
យ ្យ	yô
រ ្រ	rô
ល ្ល	lô
វ ្វ	vô
ស ្ស	sâ
ហ ្ហ	hâ
ឡ (្ឡ)	lâ
អ ្អ	ʔâ
*ｸﾒｰﾙ文字(ﾑｰﾙ体)
ក ្ក	kâ
ខ ្ខ	khâ
គ ្គ	kô
ឃ ្ឃ	khô
ង ្ង	ngô
ច ្ច	châ
ឆ ្ឆ	chhâ
ជ ្ជ	chô
ឈ ្ឈ	chhô
ញ ្ញ	nhô
ដ ្ដ	dâ
ឋ ្ឋ	thâ
ឌ ្ឌ	dô
ឍ ្ឍ	thô
ណ ្ណ	nâ
ត ្ត	tâ
ថ ្ថ	thâ
ទ ្ទ	tô
ធ ្ធ	thô
ន ្ន	nô
ប ្ប	bâ
ផ ្ផ	phâ
ព ្ព	pô
ភ ្ភ	phô
ម ្ម	mô
យ ្យ	yô
រ ្រ	rô
ល ្ល	lô
វ ្វ	vô
ស ្ស	sâ
ហ ្ហ	hâ
ឡ (្ឡ)	lâ
អ ្អ	ʔâ
*ビルマ文字
a.	◌
a	ာ/ါ
a:	ား/ါး
i.	ိ
i	ီ
i:	ီး
u.	ု
u	ူ
u:	ူး
e.	ေ့
e	ေ
e:	ေး
ɛ.	ဲ့
ɛ	ယ်
ɛ:	ဲ
o.	ို့
o	ို
o:	ိုး
aɴ.	န့်/မ့်/ံ့
aɴ	န်/မ်/ံ
aɴ:	န်း/မ်း/ံး
aiɴ.	ိုင့်
aiɴ	ိုင်
aiɴ:	ိုင်း
auɴ.	ောင့်
auɴ	ောင်
auɴ:	ောင်း
iɴ.	င့်/ဉ့်
iɴ	င်/ဉ်
iɴ:	င်း/ဉ်း
uɴ.	ွန့်/ွမ့်
uɴ	ွန်/ွမ်
uɴ:	ွန်း/ွမ်း
eiɴ.	ိန့်/ိမ့်
eiɴ	ိန်/ိမ်
eiɴ:	ိန်း/ိမ်း
ouɴ.	ုန့်/ုမ့်/ုံ့
ouɴ.	ုန်/ုမ်/ုံ
ouɴ:	ုန်း/ုမ်း/ုံး
aʔ	တ်/ပ်
aɪʔ	ိုက်
aʊʔ	ောက်
ɪʔ	စ်
ʊʔ	ွတ်/ွပ်
eɪʔ	ိတ်/ိပ်
ɛʔ	က်
oʊʔ	ုတ်/ုပ်
က	k
ခ	kʰ
ဂ	g
ဃ	g
င	ŋ
စ	s
ဆ	sʰ
ဇ	z
ဈ	z
ည	ɲ
ဋ	t
ဌ	tʰ
ဍ	d
ဎ	d
ဏ	n
တ	t
ထ	tʰ
ဒ	d
ဓ	d
န	n
ပ	p
ဖ	pʰ
ဗ	b
ဘ	b
မ	m
ယ	j
ရ	j
လ	l
ဝ	w
သ	θ`
